/*
1149 RGB거리
RGB거리에는 집이 N개 있다. 
거리는 선분으로 나타낼 수 있고, 1번 집부터 N번 집이 순서대로 있다.
집은 빨강, 초록, 파랑 중 하나의 색으로 칠해야 한다. 
각각의 집을 빨강, 초록, 파랑으로 칠하는 비용이 주어졌을 때, 아래 규칙을 만족하면서 모든 집을 칠하는 비용의 최솟값을 구해보자.
1번 집의 색은 2번 집의 색과 같지 않아야 한다.
N번 집의 색은 N-1번 집의 색과 같지 않아야 한다.
i(2 ≤ i ≤ N-1)번 집의 색은 i-1번, i+1번 집의 색과 같지 않아야 한다.

첫째 줄에 집의 수 N(2 ≤ N ≤ 1,000)이 주어진다. 
둘째 줄부터 N개의 줄에는 각 집을 빨강, 초록, 파랑으로 칠하는 비용이 1번 집부터 한 줄에 하나씩 주어진다. 
집을 칠하는 비용은 1,000보다 작거나 같은 자연수이다.
*/
#include <stdio.h>
int MIN(int a, int b)
{
	return (a>b ? b:a);
}
int MIN3(int a, int b, int c)
{
	return ((a>b ? b:a)>c ? c:(a>b ? b:a));
} 
int main()
{
	int N, i;
	int arr[3][1001]={0}, dp[3][1001]={0};
	
	scanf("%d", &N);
	for(i=1; i<=N; i++)
		scanf("%d %d %d", &arr[0][i], &arr[1][i], &arr[2][i]);
	
	for(i=1; i<=N; i++)
	{
		dp[0][i] = MIN(dp[1][i-1], dp[2][i-1])+arr[0][i];
		dp[1][i] = MIN(dp[0][i-1], dp[2][i-1])+arr[1][i];
		dp[2][i] = MIN(dp[0][i-1], dp[1][i-1])+arr[2][i];
	}
	printf("%d", MIN3(dp[0][N], dp[1][N], dp[2][N]));
	return 0;
}
